app/controllers/users_controller.rb

  def show
    @user = User.find_by(id: params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT ?  [["LIMIT", 1]]

  def create
    @user = User.new(
      name: params[:name],
      email: params[:email],
      image_name: "default_user.jpg",
      password: params[:password]
    )
    if @user.save
---
INSERT INTO "users" ("name", "email", "created_at", "updated_at", "image_name", "password") VALUES (?, ?, ?, ?, ?, ?)  [["name", "hoge"], ["email", "kaito@hoge.com"], ["created_at", 2017-05-28 07:44:33 UTC], ["updated_at", 2017-05-28 07:44:33 UTC], ["image_name", "default_user.jpg"], ["password", "password"]]